<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN"><HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
<META NAME="GENERATOR" CONTENT="Microsoft FrontPage 5.0">
<link rel="stylesheet" type="text/css" href="style.css">
<TITLE> Intel&reg; Network Adapters Hurtig installationguide</TITLE>
</HEAD>
<BODY>
<H1>
<font color="#000000">Installation af Intel&reg; PRO netv&aelig;rksadapter</font></H1>
<p>
<i>Revision 04/2004</i></p>
<DIV>
<hr>
<DIV>
<h2>
<font color="#000000">Installer Intel PCI, PCI-X eller PCI-Express*-adapter</font></h2>
<ol>
  <li>
    <p class="numlst"><font color="#000000">Sluk computeren, og fjern netledningen.</font></li>
  <li>
    <p class="numlst"><font color="#000000">Fjern computerd&aelig;kslet og adapterslotd&aelig;kslet fra den slot, der matcher din adapter.</font></li>
  <li>
    <p class="numlst"><font color="#000000">For <b>PCI Express</b>-adaptere: inds&aelig;t adapterkantkonnektoren i PCI Express-slotten, og fastsp&aelig;nd b&oslash;jlen til chassiset.<br> For <b>PCI og PCI-X</b>-adaptere: l&aelig;g adapterkantkonnektoren fast i PCI-slotten, til den er fuldt ud indsat. Fastg&oslash;r b&oslash;jlen til chassiset. </font></li>
  <li>
    <p class="numlst">S&aelig;t atter d&aelig;kslet p&aring; computeren. Is&aelig;t netledningen.</li>
</ol>
    <h2>Tilslutning af netv&aelig;rkskabel</h2>
</DIV>
<DIV>
</DIV>
<p><font color="#000000"><b>Intel&reg; PRO/100 og PRO/1000-kobberadaptere</b> Tilslut netv&aelig;rkskablet eller -kablerne til adapteren vha. enten kategori 3, 4 eller 5 TPE (Twisted Pair Ethernet) netv&aelig;rkskabel til 10 Mbps-netv&aelig;rk. Anvend kategori 5 (4-par) kabel til 100 eller 1000 Mbps-netv&aelig;rk samt til eventuelle faste netv&aelig;rk.<br> <br> <b>Intel&reg; PRO/1000 fiberadaptere med SC-konnektor:</b> Aftag og gem d&aelig;kslet til det fiberoptike stik. Is&aelig;t et 1000Base-SX duplex SC fiberoptisk stik i TX/RX-portene adapterbeslaget.<br> <br> <b>Intel&reg; PRO/1000 fiberadaptere med LC-konnektor:</b> Aftag og gem d&aelig;kslet til det fiberoptike stik. Is&aelig;t et LC-stik i adapteren med det korrekte kabel til din adaptertype <span class="295061618-17042002">(1000BASE-SX eller 1000BASE-LX). Konverteringskabler til andre stiktyper (f.eks. SC) kan anvendes, hvis kablet stemmer overens med adapterens optiske specifikationer, herunder l&aelig;ngdebegr&aelig;nsninger.<br> <br></span></font> Start computeren og f&oslash;lg nedenst&aring;ende instruktioner for installation af driveren.
</DIV>
<h2>
<font color="#000000">Installer drivere og </font>udvidelser</h2>
<p>
<i><font color="#000000">Bem&aelig;rk:  Intel PRO/1000 Serveradaptere fungerer ikke med Windows* 95, Windows 98* og Windows Me* computere.</font></i></p>
<h3><font color="#000000">Windows-operativsystemer (undtagen Windows NT* 4.0)</font></h3>
<font COLOR="#231f20">
<p ALIGN="LEFT">Bem&aelig;rk, at du skal have administratorrettigheder til operativsystemet for at installere driverne. </p>
<ol>
  <li>
<p ALIGN="LEFT" class="numlst">Adapteren fandt og Windows enten installerer en Windows-resident driver eller starter <b>Ny hardware fundet</b>-guiden.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Hvis guiden starter, skal du f&oslash;lge prompterne for at installere driveren fra cd'en i pakken.  </p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Hvis en Windows-resident driver installerer (guiden vises ikke), skal du opdatere driveren ved at inds&aelig;tte Intel-cd'en og klikke p&aring; knappen <b>Installer drivere </b>, n&aring;r Autorun-vinduet <b>Intel PRO Network Connections </b>vises.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">N&aring;r dialogboksen <b>Installer valgmuligheder</b>vises, skal du v&aelig;lge <b>Advanced Network Services </b>, hvis du definerer team eller VLAN'er.</p>
  </li>
</ol>
</font>
<DIV>
<h3><font color="#000000">Windows NT* 4.0</font></h3>
<P>
<font color="#000000">Bem&aelig;rk:  Intel PROSet hj&aelig;lpesoftwaren installeres automatisk under installationen af adapterdriveren.</font></P>
<ol>
  <li>
    <p CLASS="numlst"><font color="#000000">Start Windows NT 4.0, dobbeltklik p&aring; ikonet Netv&aelig;rk i Kontrolpanel, klik p&aring; fanen Netv&aelig;rkskort og klik p&aring; Tilf&oslash;j.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Is&aelig;t den cd, der kom med adapteren, eller peg p&aring; andet medium, n&aring;r der vises en liste over netv&aelig;rkskort, og klik p&aring; Har disk.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Hvis sk&aelig;rmbilledet til automatisk afspilning vises, skal du lukke det og forts&aelig;tte.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Angiv stien, klik p&aring; OK og forts&aelig;t installationen. N&aring;r du er f&aelig;rdig, vises den nye Intel-adapter p&aring; listen Netv&aelig;rkskort.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Afslut ved at klikke p&aring; Luk.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Genstart computeren.</font></p>
  </li>
</ol>
</DIV>
<h3>
<font color="#000000">Linux*</font> </h3>
<p>For at bygge en bin&aelig;r RPM*-pakke til denne driver, skal du k&oslash;re 'rpmbuild -tb &lt;filename.tar.gz&gt;'. Erstat &lt;filename.tar.gz&gt; med driverens filnavn.</p>
<table cellPadding="4" width="100%" border="0">
  <tr>
    <td vAlign="top" align="middle" width="21">
    &nbsp;</td>
    <td><i><b>BEM&AElig;RKNINGER</b>:</i> For at build'et skal fungere korrekt, SKAL den aktuelt k&oslash;rende kernel matche versionen og konfigurationen for de installerede kernel-kilder. Hvis du lige har genkompileret kernel'en, skal du genstarte systemet nr.
    <p>RPM-funktionalitet testes kun i Red Hat-distributioner.<p>For Intel PRO/100 adaptere skal du bruge e100 som drivernavn.</td>
  </tr>
</table>
<ol>
  <li>
  <p class="numlst">Flyt basisdriver tar-filen til det &oslash;nskede bibliotek. Brug f.eks. '/home/username/e1000' eller '/usr/local/src/e1000'.
  </li>
  <li>
  <p class="numlst">Untar/unzip arkivet, hvor &lt;x.x.x&gt; er versionsnummeret for driverens tar-fil: </p>
  <blockquote>
    <p class="numlst">tar zxf e1000-&lt;x.x.x&gt;.tar.gz </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Ret driverens src-bibliotekt, hvor &lt;x.x.x&gt; er versionsnummeret for driverens tar: </p>
  <blockquote>
    <p class="numlst">cd e1000-&lt;x.x.x&gt;/src/ </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Kompiler drivermodulet: </p>
  <blockquote>
    <p class="numlst">make install </p>
  </blockquote>
  <p class="numlst">Den bin&aelig;re bliver installeret som:</p>
  <blockquote>
    <p class="numlst">/lib/modules/&lt;kernel_version&gt;/kernel/drivers/net/e1000.o</p>
  </blockquote>
  <p class="numlst">Installationsplaceringerne vist ovenfor er standardplaceringerne. De er m&aring;ske ikke korrekte for visse Linux-distributioner. Yderligere oplysninger findes p&aring; <a href="../LINUX/ldistrib.htm">ldistrib.htm</a>.</li>
  <li>
  <p class="numlst">Installer modulet: </p>
  <blockquote>
    <p class="numlst">insmod e1000 &lt;parameter&gt;=&lt;value&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Tildel en IP-adresse til interfacet ved at angive f&oslash;lgende, hvor &lt;x&gt; er interfacenummeret: </p>
  <blockquote>
    <p class="numlst">ifconfig eth&lt;x&gt; &lt;IP_address&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Verificer, at interfacet fungerer. Indtast f&oslash;lgende, hvor &lt;IP_address&gt; er IP-adressen p&aring; en anden computer p&aring; samme subnet som det interface, der testes: </p>
  <blockquote>
    <p class="numlst">ping &lt;IP_address&gt; </p>
  </blockquote>
  </li>
</ol>
<h3>
<font color="#000000">Andre operativsystemer</font> </h3>
<P><font color="#000000">Der findes oplysninger om installation af andre drivere i <i>Brugervejledningen</i> p&aring; adapter-cd&rsquo;en eller g&aring; til kundesupport-webstedet: <a href="http://support.intel.com">http://support.intel.com</a>.</font></P>
<DIV>
<hr>
<P CLASS="Proc-Step"><font color="#000000">*<a href="ld_dan.htm">Juridiske oplysninger</a></font></P>
</DIV>
</BODY>
</HTML>