<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN"><HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
<META NAME="GENERATOR" CONTENT="Microsoft FrontPage 5.0">
<link rel="stylesheet" type="text/css" href="style.css">
<TITLE> Gu&iacute;a r&aacute;pida de instalaci&oacute;n de adaptadores de red Intel&reg;</TITLE>
</HEAD>
<BODY>
<H1>
<font color="#000000">Instalaci&oacute;n de adaptadores de red Intel&reg; PRO</font></H1>
<p>
<i>Revisado en abril de 2004</i></p>
<DIV>
<hr>
<DIV>
<h2>
<font color="#000000">Instalaci&oacute;n del adaptador Intel PCI, PCI-X o PCI-Express*</font></h2>
<ol>
  <li>
    <p class="numlst"><font color="#000000">Apague su PC y desconecte el cable de alimentaci&oacute;n.</font></li>
  <li>
    <p class="numlst"><font color="#000000">Quite la cubierta del sistema y la cubierta de la ranura del adaptador en la ranura que corresponde al adaptador.</font></li>
  <li>
    <p class="numlst"><font color="#000000">Para los adaptadores <b>PCI Express</b>: inserte el conector del borde del adaptador en la ranura PCI Express y fije el soporte al chasis.<br> Para los adaptadores <b>PCI y PCI-X</b>: coloque firmemente el conector del borde del adaptador en la ranura PCI hasta que se haya insertado completamente. Fije el soporte al chasis. </font></li>
  <li>
    <p class="numlst">Vuelva a colocar la cubierta de su PC. Conecte el cable de alimentaci&oacute;n.</li>
</ol>
    <h2>Conexi&oacute;n del cable de red</h2>
</DIV>
<DIV>
</DIV>
<p><font color="#000000"><b>Adaptadores de cobre Intel&reg; PRO/100 y PRO/1000:</b> Conecte los cables de red al adaptador utilizando un cable de red Ethernet par trenzado (TPE) de Categor&iacute;a 3, 4 o 5 para redes de 10 Mbps. Utilice un cable de Categor&iacute;a 5 (de 4 pares) para redes de 100 o 1000 Mbps y para las redes residenciales.<br> <br> <b>Adaptadores de fibra &oacute;ptica Intel&reg; PRO/1000 con conector SC:</b> Retire y guarde la cubierta del conector de fibra &oacute;ptica. Introduzca un conector de fibra &oacute;ptica tipo SC 1000Base-SX d&uacute;plex en los puertos TX/RX del soporte del adaptador.<br> <br> <b>Adaptadores de fibra &oacute;ptica Intel&reg; PRO/1000 con conector LC:</b> Retire y guarde la cubierta del conector de fibra &oacute;ptica. Inserte un conector LC en el adaptador, con el cableado correcto para el tipo del adaptador <span class="295061618-17042002">(1000BASE-SX o 1000BASE-LX). Puede utilizar cables de conversi&oacute;n a otros tipos de conector (como SC) si el cableado se ajusta a las especificaciones &oacute;pticas del adaptador, incluyendo las limitaciones de longitud.<br> <br></span></font> Inicie su PC y siga las instrucciones de instalaci&oacute;n de los controladores que se ofrecen a continuaci&oacute;n.
</DIV>
<h2>
<font color="#000000">Instalaci&oacute;n de los controladores y </font>las extensiones</h2>
<p>
<i><font color="#000000">Nota:  Los adaptadores de servidor Intel PRO/1000 no funcionan en los sistemas Windows* 95, Windows 98* o Windows Me*.</font></i></p>
<h3><font color="#000000">Sistemas operativos Windows (excepto Windows NT* 4.0)</font></h3>
<font COLOR="#231f20">
<p ALIGN="LEFT">Para poder instalar los controladores, debe tener derechos de administrador en el sistema operativo. </p>
<ol>
  <li>
<p ALIGN="LEFT" class="numlst">El adaptador se detecta autom&aacute;ticamente, y Windows instala un controlador residente del sistema operativo o inicia el asistente <b>Nuevo hardware encontrado</b>.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Si se inicia el asistente, siga las indicaciones para instalar el controlador desde el CD que se suministra.  </p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Si se instala un controlador residente de Windows (no aparece el asistente), inserte el CD de Intel y haga clic en el bot&oacute;n <b>Instalar controladores</b> cuando aparece la ventana de ejecuci&oacute;n autom&aacute;tica <b>Conexiones de red Intel PRO</b> para actualizar el controlador.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Cuando aparezca el cuadro de di&aacute;logo <b>Opciones de instalaci&oacute;n</b>, seleccione <b>Servicios de red avanzados</b> si necesita configurar equipos o VLAN.</p>
  </li>
</ol>
</font>
<DIV>
<h3><font color="#000000">Windows NT 4.0</font></h3>
<P>
<font color="#000000">Nota:  El software de utilidades Intel PROSet se instala autom&aacute;ticamente durante la instalaci&oacute;n del controlador de adaptador.</font></P>
<ol>
  <li>
    <p CLASS="numlst"><font color="#000000">Inicie Windows NT 4.0, haga doble clic en el icono Red en el Panel de control, luego haga clic en la ficha Adaptadores y a continuaci&oacute;n en Agregar.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Cuando aparezca la lista de adaptadores, en lugar de elegir un adaptador de la lista, inserte el CD suministrado con el adaptador o se&ntilde;ale a alg&uacute;n otro medio, y haga clic en Utilizar disco.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Si aparece la pantalla de ejecuci&oacute;n autom&aacute;tica del CD, ci&eacute;rrela y contin&uacute;e.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Especifique la ruta, haga clic en Aceptar y contin&uacute;e la instalaci&oacute;n. Al terminar, aparece el nuevo adaptador Intel en la lista Adaptadores de red.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Haga clic en Cerrar para finalizar.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Reinicie su PC.</font></p>
  </li>
</ol>
</DIV>
<h3>
<font color="#000000">Linux*</font> </h3>
<p>Para crear un paquete RPM* binario de este controlador, ejecute run&nbsp;'rpmbuild -tb &lt;nombrearchivo.tar.gz&gt;'. Sustituya &lt;nombrearchivo.tar.gz&gt; por el nombre de archivo espec&iacute;fico del controlador.</p>
<table cellPadding="4" width="100%" border="0">
  <tr>
    <td vAlign="top" align="middle" width="21">
    &nbsp;</td>
    <td><i><b>NOTAS</b>:</i> Para que la creaci&oacute;n funcione correctamente, el kernel en ejecuci&oacute;n DEBE coincidir con la versi&oacute;n y configuraci&oacute;n de las fuentes instaladas del kernel. Si acaba de recompilar el kernel, reinicie el sistema.
    <p>El funcionamiento de RPM s&oacute;lo se ha probado con las distribuciones Red Hat.<p>Para los adaptadores Intel PRO/100, utilice e100 como nombre de controlador.</td>
  </tr>
</table>
<ol>
  <li>
  <p class="numlst">Mueva el archivo con la extensi&oacute;n tar del controlador base al directorio que seleccione. Por ejemplo, utilice '/home/username/e1000' o '/usr/local/src/e1000'.
  </li>
  <li>
  <p class="numlst">Descomprima el archivo tar o unzip, donde &lt;x.x.x&gt; es el n&uacute;mero de versi&oacute;n del archivo tar del controlador: </p>
  <blockquote>
    <p class="numlst">tar zxf e1000-&lt;x.x.x&gt;.tar.gz </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Vaya al directorio src del controlador, donde &lt;x.x.x&gt; es el n&uacute;mero de versi&oacute;n del archivo tar del controlador: </p>
  <blockquote>
    <p class="numlst">cd e1000-&lt;x.x.x&gt;/src/ </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Compile el m&oacute;dulo del controlador: </p>
  <blockquote>
    <p class="numlst">make install </p>
  </blockquote>
  <p class="numlst">El archivo binario se instalar&aacute; como:</p>
  <blockquote>
    <p class="numlst">/lib/modules/&lt;versi&oacute;n_kernel&gt;/kernel/drivers/net/e1000.o</p>
  </blockquote>
  <p class="numlst">Las ubicaciones de instalaci&oacute;n descritas anteriormente son las predeterminadas, y es posible que no sean correctas para determinadas distribuciones de Linux. Para m&aacute;s informaci&oacute;n, vaya a <a href="../LINUX/ldistrib.htm">ldistrib.htm</a>.</li>
  <li>
  <p class="numlst">Instale el m&oacute;dulo: </p>
  <blockquote>
    <p class="numlst">insmod e1000 &lt;par&aacute;metro&gt;=&lt;valor&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Introduzca lo siguiente para asignar una direcci&oacute;n IP a la interfaz, donde &lt;x&gt; es el n&uacute;mero de interfaz: </p>
  <blockquote>
    <p class="numlst">ifconfig eth&lt;x&gt; &lt;direcci&oacute;n_IP&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Compruebe que funcione la interfaz. Introduzca lo siguiente, donde &lt;direcci&oacute;n_IP&gt; es la direcci&oacute;n IP de otra m&aacute;quina situada en la misma subred que la interfaz que se est&aacute; probando: </p>
  <blockquote>
    <p class="numlst">ping &lt;direcci&oacute;n_IP&gt; </p>
  </blockquote>
  </li>
</ol>
<h3>
<font color="#000000">Otros sistemas operativos</font> </h3>
<P><font color="#000000">Para instalar otros controladores, consulte la <i>Gu&iacute;a del usuario</i> en el CD del adaptador o visite el sitio web de asistencia al cliente: <a href="http://support.intel.com">http://support.intel.com</a>.</font></P>
<DIV>
<hr>
<P CLASS="Proc-Step"><font color="#000000">*<a href="ld_esn.htm">Informaci&oacute;n legal</a></font></P>
</DIV>
</BODY>
</HTML>