<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN"><HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
<META NAME="GENERATOR" CONTENT="Microsoft FrontPage 5.0">
<link rel="stylesheet" type="text/css" href="style.css">
<TITLE> Guide d'installation rapide des cartes r&eacute;seau Intel&reg;</TITLE>
</HEAD>
<BODY>
<H1>
<font color="#000000">Installation des cartes r&eacute;seau Intel&reg; PRO</font></H1>
<p>
<i>R&eacute;vision 04/2004</i></p>
<DIV>
<hr>
<DIV>
<h2>
<font color="#000000">Installer une carte Intel PCI, PCI-X ou PCI-Express*</font></h2>
<ol>
  <li>
    <p class="numlst"><font color="#000000">Mettez l'ordinateur hors tension et d&eacute;branchez le cordon d'alimentation.</font></li>
  <li>
    <p class="numlst"><font color="#000000">Retirez le panneau de l'ordinateur et le panneau du connecteur de carte correspondant &agrave; votre carte.</font></li>
  <li>
    <p class="numlst"><font color="#000000">Pour les cartes <b>PCI Express</b> : ins&eacute;rez le connecteur au bord de la carte dans le connecteur PCI Express, et attachez solidement le support sur le ch&acirc;ssis.<br> Pour les cartes <b>PCI et PCI-X</b> : ins&eacute;rez fermement le connecteur au bord de la carte dans le connecteur PCI, jusqu'&agrave; ce qu'il soit compl&egrave;tement log&eacute;. Attachez solidement le support sur le ch&acirc;ssis. </font></li>
  <li>
    <p class="numlst">Remettez le panneau de l'ordinateur en place. Branchez le cordon d'alimentation.</li>
</ol>
    <h2>Brancher le c&acirc;ble r&eacute;seau</h2>
</DIV>
<DIV>
</DIV>
<p><font color="#000000"><b>Cartes cuivre Intel&reg; PRO/100 et PRO/1000 :</b> Branchez le(s) c&acirc;ble(s) r&eacute;seau sur la carte en utilisant une paire torsad&eacute;e Ethernet de cat&eacute;gorie 3, 4 ou 5 pour les r&eacute;seaux 10 Mbit/s. Utilisez un c&acirc;ble de cat&eacute;gorie 5 (4 paires) pour les r&eacute;seaux 100 Mbit/s ou 1000 Mbit/s, ainsi que pour tout r&eacute;seau r&eacute;sidentiel.<br> <br> <b>Cartes fibre Intel&reg; PRO/1000 avec connecteur SC :</b> Retirez le panneau du connecteur &agrave; fibre optique et mettez-le sur le c&ocirc;t&eacute;. Ins&eacute;rez un connecteur SC &agrave; fibre optique de type 1000Base-SX duplex dans les ports TX/RX du support de la carte.<br> <br> <b>Cartes fibre Intel&reg; PRO/1000 avec connecteur LC :</b> Retirez le panneau du connecteur &agrave; fibre optique et mettez-le sur le c&ocirc;t&eacute;. Ins&eacute;rez un connecteur LC dans la carte en utilisant un c&acirc;blage appropri&eacute; pour le type de carte <span class="295061618-17042002">(1000BASE-SX ou 1000BASE-LX). Les c&acirc;bles de conversion pour d'autres types de connecteur (p. ex., un connecteur SC) peuvent &ecirc;tre utilis&eacute;s si le c&acirc;blage est conforme aux sp&eacute;cifications optiques de la carte, y compris les limites de longueur.<br> <br></span></font> D&eacute;marrez votre ordinateur et suivez les instructions d'installation des pilotes ci-dessous.
</DIV>
<h2>
<font color="#000000">Installer les pilotes et les </font>extensions</h2>
<p>
<i><font color="#000000">Remarque&nbsp;:  les cartes Intel PRO/1000 pour serveur ne fonctionnent pas sur les ordinateurs Windows* 95, Windows 98* et Windows Me*.</font></i></p>
<h3><font color="#000000">Syst&egrave;mes d'exploitation Windows (sauf Windows NT* 4.0)</font></h3>
<font COLOR="#231f20">
<p ALIGN="LEFT">Notez que vous devez disposer de droits d'administrateur sur le syst&egrave;me d'exploitation pour installer les pilotes. </p>
<ol>
  <li>
<p ALIGN="LEFT" class="numlst">La carte est d&eacute;tect&eacute;e et Windows installe un pilote Windows r&eacute;sident ou d&eacute;marre l'<b>Assistant Mat&eacute;riel d&eacute;tect&eacute;</b>.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Si l'assistant d&eacute;marre, suivez les invites pour installer le pilote depuis le CD fourni avec la carte.  </p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Si un pilote Windows r&eacute;sident est install&eacute; (l'assistant ne s'affiche pas), mettez le pilote &agrave; jour en ins&eacute;rant le CD Intel et en cliquant sur le bouton <b>Installer les pilotes</b> lorsque la fen&ecirc;tre d'ex&eacute;cution automatique <b>Connexions r&eacute;seau Intel PRO </b>s'affiche.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Lorsque la bo&icirc;te de dialogue <b>Options d'installation</b> s'affiche, s&eacute;lectionnez <b>Services r&eacute;seau avanc&eacute;s</b> si vous voulez configurer des associations ou des VLAN.</p>
  </li>
</ol>
</font>
<DIV>
<h3><font color="#000000">Windows NT 4.0</font></h3>
<P>
<font color="#000000">Remarque&nbsp;:  l'utilitaire Intel PROSet est install&eacute; automatiquement au cours de l'installation du pilote de la carte.</font></P>
<ol>
  <li>
    <p CLASS="numlst"><font color="#000000">D&eacute;marrez Windows NT 4.0, double-cliquez sur l'ic&ocirc;ne R&eacute;seau du Panneau de configuration, cliquez sur l'onglet Cartes r&eacute;seau, puis sur Ajouter.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Lorsque la liste des cartes r&eacute;seau appara&icirc;t, ins&eacute;rez le CD livr&eacute; avec votre carte ou indiquez un autre support plut&ocirc;t que de choisir une carte dans la liste, et cliquez ensuite sur Disquette fournie.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Si un &eacute;cran d'ex&eacute;cution automatique appara&icirc;t, fermez-le.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Sp&eacute;cifiez le chemin d'acc&egrave;s, cliquez sur OK et continuez l'installation. Lorsque celle-ci est termin&eacute;e, la nouvelle carte Intel appara&icirc;t dans la liste Cartes r&eacute;seau.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Cliquez sur Fermer pour terminer.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Red&eacute;marrez l'ordinateur.</font></p>
  </li>
</ol>
</DIV>
<h3>
<font color="#000000">Linux*</font> </h3>
<p>Pour cr&eacute;er un package RPM* binaire de ce pilote, ex&eacute;cutez &nbsp;'rpmbuild -tb &lt;nom_du_fichier.tar.gz&gt;'. Remplacez &lt;nom_du_fichier.tar.gz&gt; par le nom de fichier sp&eacute;cifique du pilote.</p>
<table cellPadding="4" width="100%" border="0">
  <tr>
    <td vAlign="top" align="middle" width="21">
    &nbsp;</td>
    <td><i><b>REMARQUE</b>&nbsp;:</i> pour que le module fonctionne correctement, la version et la fonfiguration du noyau actuellement ex&eacute;cut&eacute; DOIVENT correspondre aux source du noyau install&eacute;. Si vous venez de recompiler le noyau, red&eacute;marrez l'ordinateur maintenant.
    <p>La fonctionnalit&eacute; RPM a &eacute;t&eacute; test&eacute;e uniquement sur les distributions Red Hat.<p>Pour les cartes Intel PRO/100, utilisez e100 comme nom de pilote.</td>
  </tr>
</table>
<ol>
  <li>
  <p class="numlst">D&eacute;placez le fichier tar du pilote de base dans un r&eacute;pertoire au choix. Par exemple, utilisez &quot;/home/username/e1000&quot; ou &quot;/usr/local/src/e1000&quot;.
  </li>
  <li>
  <p class="numlst">D&eacute;ballez/d&eacute;compressez l'archive, o&ugrave; &lt;x.x.x&gt; correspond &agrave; la version du fichier tar du pilote&nbsp;: </p>
  <blockquote>
    <p class="numlst">tar zxf e1000-&lt;x.x.x&gt;.tar.gz </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Passez au r&eacute;pertoire src du pilote, o&ugrave; &lt;x.x.x&gt; correspond au num&eacute;ro de version du fichier tar du pilote&nbsp;: </p>
  <blockquote>
    <p class="numlst">cd e1000-&lt;x.x.x&gt;/src/ </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Compilez le module du pilote&nbsp;: </p>
  <blockquote>
    <p class="numlst">make install </p>
  </blockquote>
  <p class="numlst">Le fichier binaire sera install&eacute; sous&nbsp;:</p>
  <blockquote>
    <p class="numlst">/lib/modules/&lt;kernel_version&gt;/kernel/drivers/net/e1000.o</p>
  </blockquote>
  <p class="numlst">Les emplacements d'installations ci-dessus sont les emplacements par d&eacute;faut. Il est possible qu'ils ne soient pas corrects pour certaines distributions Linux. Pour de plus amples informations, visitez <a href="../LINUX/ldistrib.htm">ldistrib.htm</a>.</li>
  <li>
  <p class="numlst">Installez le module&nbsp;: </p>
  <blockquote>
    <p class="numlst">insmod e1000 &lt;param&egrave;tre&gt;=&lt;valeur&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Affectez une adresse IP &agrave; l'interface en entrant ce qui suit, o&ugrave; &lt;x&gt; correspond au num&eacute;ro de l'interface&nbsp;: </p>
  <blockquote>
    <p class="numlst">ifconfig eth&lt;x&gt; &lt;adresse_IP&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">V&eacute;rifiez que l'interface fonctionne. Entrez ce qui suit, o&ugrave; &lt;adresse_IP&gt; correspond &agrave; l'adresse IP d'un autre ordinateur du sous-r&eacute;seau sur lequel l'interface est test&eacute;e&nbsp;: </p>
  <blockquote>
    <p class="numlst">ping &lt;adress_IP&gt; </p>
  </blockquote>
  </li>
</ol>
<h3>
<font color="#000000">Autres syst&egrave;mes d'exploitation</font> </h3>
<P><font color="#000000">Pour installer d'autres pilotes, reportez-vous au <i>Guide de l'utilisateur</i> sur le CD de la carte, ou visitez le site Web d'assistance &agrave; la client&egrave;le &agrave; l'adresse : <a href="http://support.intel.com">http://support.intel.com</a>.</font></P>
<DIV>
<hr>
<P CLASS="Proc-Step"><font color="#000000">*<a href="ld_fra.htm">Avertissement</a></font></P>
</DIV>
</BODY>
</HTML>