<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN"><HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
<META NAME="GENERATOR" CONTENT="Microsoft FrontPage 5.0">
<link rel="stylesheet" type="text/css" href="style.css">
<TITLE> Intel&reg; Network Adapters snabbguide f&ouml;r installation</TITLE>
</HEAD>
<BODY>
<H1>
<font color="#000000">Intel&reg; PRO Network Adapter installation</font></H1>
<p>
<i>Revision 04/2004</i></p>
<DIV>
<hr>
<DIV>
<h2>
<font color="#000000">Installera Intel PCI-, PCI-X- eller PCI-Express*-kortet</font></h2>
<ol>
  <li>
    <p class="numlst"><font color="#000000">St&auml;ng av datorn och koppla ifr&aring;n n&auml;tkabeln.</font></li>
  <li>
    <p class="numlst"><font color="#000000">Ta bort datorns h&ouml;lje och kortplatsluckan fr&aring;n en kortplats som kan anv&auml;ndas f&ouml;r ditt kort.</font></li>
  <li>
    <p class="numlst"><font color="#000000">F&ouml;r <b>PCI Express</b>-kort: s&auml;tt in kortets kantkontakt i PCI Express-platsen och f&auml;st kortklammern vid h&ouml;ljet.<br> F&ouml;r <b>PCI- och PCI-X</b>-kort: f&ouml;r best&auml;mt in kortets kantkontakt i PCI-platsen tills det &auml;r helt intryckt. F&auml;st kortklammern vid h&ouml;ljet. </font></li>
  <li>
    <p class="numlst">S&auml;tt tillbaka datorns h&ouml;lje. Anslut str&ouml;mkabeln.</li>
</ol>
    <h2>Ansluta n&auml;tverkskabeln</h2>
</DIV>
<DIV>
</DIV>
<p><font color="#000000"><b>Intel&reg; PRO/100 och PRO/1000 kopparkort:</b> Anslut kabeln eller kablarna till kortet med en TPE-n&auml;tverkskabel (Twisted Pair Ethernet) av kategori 3, 4 eller 5 f&ouml;r 10 Mbps-n&auml;tverk. Anv&auml;nd kabel av kategori 5 (4 par) f&ouml;r 100 eller 1000 Mbps-n&auml;tverk och f&ouml;r alla n&auml;tverk i boendemilj&ouml;.<br> <br> <b>Intel&reg; PRO/1000 fiberkort med SC-kontakt:</b> Ta bort och spara luckan till fiberoptikanslutningen. F&ouml;r in en fiberoptikanslutning av 1000Base-SX duplextyp SC i TX/RX-portarna p&aring; kortklammern.<br> <br> <b>Intel&reg; PRO/1000 fiberkort med LC-kontakt:</b> Ta bort och spara luckan till fiberoptikanslutningen. F&ouml;r in en LC-kontakt i kortet, med korrekt kablage f&ouml;r din korttyp <span class="295061618-17042002">(1000BASE-SX eller 1000BASE-LX). Omvandlingskablar till andra anslutningstyper (t.ex. SC) kan anv&auml;ndas om kablarna &ouml;verensst&auml;mmer med kortets optiska specifikationer, inklusive l&auml;ngdbegr&auml;nsningar.<br> <br></span></font> Starta datorn och f&ouml;lj instruktionerna nedan f&ouml;r drivrutinsinstallation.
</DIV>
<h2>
<font color="#000000">Installera drivrutiner och </font>till&auml;gg</h2>
<p>
<i><font color="#000000">Obs!  Intel PRO/1000-serverkort fungerar inte med operativsystemen Windows* 95, Windows 98* och Windows Me*.</font></i></p>
<h3><font color="#000000">Windows-operativsystem (utom Windows NT* 4.0)</font></h3>
<font COLOR="#231f20">
<p ALIGN="LEFT">Observera att du m&aring;ste ha administrativa r&auml;ttigheter f&ouml;r att kunna installera drivrutinerna. </p>
<ol>
  <li>
<p ALIGN="LEFT" class="numlst">Kortet identifieras och Windows installerar antingen en drivrutin som redan finns i Windows eller startar <b>Guiden ny maskinvara</b>.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Om guiden startar f&ouml;ljer du instruktionerna f&ouml;r hur du installerar drivrutinen fr&aring;n den medf&ouml;ljande cd:n.  </p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Om en drivrutin som redan finns i Windows installeras (guiden visas inte) uppdaterar du drivrutinen genom att s&auml;tta in cd-skivan fr&aring;n Intel och klicka p&aring; knappen <b>Installera drivrutiner </b>n&auml;r f&ouml;nstret <b>Intel PRO-n&auml;tverksanslutningar </b>visas.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">I dialogrutan <b>Installationsalternativ </b>v&auml;ljer du <b>Advanced Network Services </b>om du beh&ouml;ver konfigurera team eller VLAN.</p>
  </li>
</ol>
</font>
<DIV>
<h3><font color="#000000">Windows NT 4.0</font></h3>
<P>
<font color="#000000">Obs!  Programvaran Intel PROSet installeras automatiskt vid installationen av kortets drivrutiner.</font></P>
<ol>
  <li>
    <p CLASS="numlst"><font color="#000000">Starta Windows NT 4.0 och dubbelklicka p&aring; n&auml;tverksikonen i Kontrollpanelen. Klicka p&aring; fliken Kort och klicka sedan p&aring; L&auml;gg till.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">N&auml;r en lista &ouml;ver kort visas matar du in cd-skivan som medf&ouml;ljde ditt Intel-kort eller v&auml;ljer andra media i st&auml;llet f&ouml;r att v&auml;lja ett kort fr&aring;n listan. Klicka sedan p&aring; Diskett finns.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Om autorun-dialogrutan visas st&auml;nger du den och forts&auml;tter.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Ange s&ouml;kv&auml;gen, klicka p&aring; OK och forts&auml;tt sedan installationen. N&auml;r installationen &auml;r f&auml;rdig visas det nya Intel-kortet i listan &ouml;ver N&auml;tverkskort.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Klicka p&aring; St&auml;ng f&ouml;r att avsluta.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Starta om datorn.</font></p>
  </li>
</ol>
</DIV>
<h3>
<font color="#000000">Linux*</font> </h3>
<p>Du kan bygga ett bin&auml;rt RPM*-paket f&ouml;r denna drivrutin genom att k&ouml;ra&nbsp;&rdquo;rpmbuild -tb &lt;filnamn.tar.gz&gt;&rdquo;. Ers&auml;tt &lt;filnamn.tar.gz&gt; med det specifika namnet f&ouml;r drivrutinen.</p>
<table cellPadding="4" width="100%" border="0">
  <tr>
    <td vAlign="top" align="middle" width="21">
    &nbsp;</td>
    <td><i><b>ANM&Auml;RKNINGAR</b>:</i> F&ouml;r att bygget ska fungera ordentligt m&aring;ste den kernel som f&ouml;r n&auml;rvarande k&ouml;rs &ouml;verensst&auml;mma med versionen och konfigurationen f&ouml;r de installerade kernel-k&auml;llorna. Om du just har kompilerat om din kernel ska du starta om datorn nu.
    <p>RPM-funktionen har endast testats med Red Hat-versioner.<p>F&ouml;r Intel PRO/100-kort ska du anv&auml;nda e100 som drivrutinsnamn.</td>
  </tr>
</table>
<ol>
  <li>
  <p class="numlst">Flytta basdrivrutinens tar-fil till den katalog du v&auml;ljer. Anv&auml;nd till exempel &rdquo;/hem/anv&auml;ndarnamn/e1000&rdquo; eller &rdquo;/usr/local/src/e1000&rdquo;.
  </li>
  <li>
  <p class="numlst">Packa upp filen (&lt;x.x.x&gt; anger versionsnumret f&ouml;r drivrutinsfilen): </p>
  <blockquote>
    <p class="numlst">tar zxf e1000-&lt;x.x.x&gt;.tar.gz</p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">&Auml;ndra till drivrutinens k&auml;llkatalog, d&auml;r &lt;x.x.x&gt; anger versionsnumret f&ouml;r drivrutinsfilen: </p>
  <blockquote>
    <p class="numlst">cd e1000-&lt;x.x.x&gt;/src/</p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Kompilera drivrutinsmodulen: </p>
  <blockquote>
    <p class="numlst">skapa installerare</p>
  </blockquote>
  <p class="numlst">Bin&auml;rfilen installeras som:</p>
  <blockquote>
    <p class="numlst">/lib/modules/&lt;kernel_version&gt;/kernel/drivers/net/e1000.o</p>
  </blockquote>
  <p class="numlst">De installationsplatser som anges ovan &auml;r standardplatserna. De kanske inte st&auml;mmer f&ouml;r vissa versioner av Linux. Mer information finns p&aring; sidan <a href="../LINUX/ldistrib.htm">ldistrib.htm</a>.</li>
  <li>
  <p class="numlst">Installera modulen: </p>
  <blockquote>
    <p class="numlst">insmod e1000 &lt;parameter&gt;=&lt;v&auml;rde&gt;</p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Tilldela en IP-adress till gr&auml;nssnittet genom att ange f&ouml;ljande, d&auml;r &lt;x&gt; &auml;r gr&auml;nssnittsnumret: </p>
  <blockquote>
    <p class="numlst">ifconfig eth&lt;x&gt; &lt;IP_address&gt;</p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Verifiera att gr&auml;nssnittet fungerar. Skriv in f&ouml;ljande, d&auml;r &lt;IP_address&gt; &auml;r en IP-adress f&ouml;r en annan maskin i samma deln&auml;t som det gr&auml;nssnitt som testas: </p>
  <blockquote>
    <p class="numlst">ping &lt;IP_address&gt;</p>
  </blockquote>
  </li>
</ol>
<h3>
<font color="#000000">Andra operativsystem</font> </h3>
<P><font color="#000000">Om du vill installera andra drivrutiner, se <i>Anv&auml;ndarhandboken</i> p&aring; Intel-cd:n eller g&aring; till Intels support-webbplats: <a href="http://support.intel.com">http://support.intel.com</a>.</font></P>
<DIV>
<hr>
<P CLASS="Proc-Step"><font color="#000000">*<a href="ld_sve.htm">Juridisk information</a></font></P>
</DIV>
</BODY>
</HTML>