<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN"><HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
<META NAME="GENERATOR" CONTENT="Microsoft FrontPage 5.0">
<link rel="stylesheet" type="text/css" href="style.css">
<TITLE> Intel&reg;-verkkosovittimien pika-asennusopas</TITLE>
</HEAD>
<BODY>
<H1>
<font color="#000000">Intel&reg; PRO -verkkosovittimen asentaminen</font></H1>
<p>
<i>Muutos 04/2004</i></p>
<DIV>
<hr>
<DIV>
<h2>
<font color="#000000">Intel PCI-, PCI-X-, tai PCI-Express* -sovittimen asentaminen</font></h2>
<ol>
  <li>
    <p class="numlst"><font color="#000000">Sammuta tietokone ja irrota virtajohto.</font></li>
  <li>
    <p class="numlst"><font color="#000000">Poista tietokoneen kansi ja sovittimen paikan suojus siit&auml; korttipaikasta, joka vastaa sovitintasi.</font></li>
  <li>
    <p class="numlst"><font color="#000000"><b>PCI Express</b> -sovittimet: aseta sovittimen reunaliitin PCI Express -paikkaan ja kiinnit&auml; pidike runkoon.<br> <b>PCI- ja PCI-X</b>-sovittimet: aseta sovittimen reunaliitin tukevasti PCI-paikkaan, niin ett&auml; se on t&auml;ysin sis&auml;ll&auml;. Kiinnit&auml; pidike runkoon. </font></li>
  <li>
    <p class="numlst">Aseta tietokoneen kansi paikalleen. Kytke virtajohto.</li>
</ol>
    <h2>Verkkokaapelin kytkeminen</h2>
</DIV>
<DIV>
</DIV>
<p><font color="#000000"><b>Intel&reg; PRO/100 -sovittimet ja PRO/1000 -kuparisovittimet:</b> Kytke verkkokaapeli tai kaapelit sovittimeen k&auml;ytt&auml;en 10 Mbps -verkkoihin tarkoitettua Cat 3-, Cat 4- tai Cat 5 -yhteensopivaa TPE (Twisted Pair Ethernet) -verkkokaapelia. K&auml;yt&auml; 100 Mbps- tai 1000 Mbps -verkossa ja kaikissa kotiverkoissa Cat 5 (4-parista) -kaapelia.<br> <br> <b>Intel&reg; PRO/1000 -kuitusovittimet, joissa SC-liitin:</b> Irrota kuituoptisen liit&auml;nn&auml;n suojus ja s&auml;ilyt&auml; se. Liit&auml; kuituoptinen kaksisuuntainen 1000Base-SX SC -liitin sovitinkiinnikkeen TX/RX-liit&auml;nt&ouml;ihin.<br> <br> <b>Intel&reg; PRO/1000 -kuitusovittimet, joissa LC-liitin:</b> Irrota kuituoptisen liit&auml;nn&auml;n suojus ja s&auml;ilyt&auml; se. Liit&auml; LC-liitin sovittimeen k&auml;ytt&auml;m&auml;ll&auml; oikeaa kaapelointia sovittimen tyypin <span class="295061618-17042002">(1000BASE-SX tai 1000BASE-LX) mukaan. Muiden liitintyyppien (kuten SC-liittimen) muuntosovittimia voidaan k&auml;ytt&auml;&auml; silloin, kun kaapelointi vastaa sovittimen optisia m&auml;&auml;rityksi&auml;, pituusrajoitukset mukaan lukien.<br> <br></span></font> K&auml;ynnist&auml; tietokone ja noudata alla olevia ohjaimen asennusohjeita.
</DIV>
<h2>
<font color="#000000">Asenna ohjaimet ja </font>laajennukset</h2>
<p>
<i><font color="#000000">Huomautus:  Intel PRO/1000 Server -sovittimet eiv&auml;t toimi Windows* 95/98/Me -tietokoneissa.</font></i></p>
<h3><font color="#000000">Windows-k&auml;ytt&ouml;j&auml;rjestelm&auml;t (ei Windows NT* 4.0)</font></h3>
<font COLOR="#231f20">
<p ALIGN="LEFT">Huomaa, ett&auml; sinulla on oltava j&auml;rjestelm&auml;nvalvojan oikeudet, jotta voit asentaa ohjaimet. </p>
<ol>
  <li>
<p ALIGN="LEFT" class="numlst">Sovitin on tunnistettu ja Windows asentaa joko Windowsissa olevan ohjaimen tai k&auml;ynnist&auml;&auml; ohjatun <b>Etsi uusi laite</b>-toiminnon.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Jos ohjattu toiminto k&auml;ynnistyy, asenna ohjain sen kehotteiden mukaan t&auml;m&auml;n paketin CD-levyst&auml;.  </p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Jos Windows asentaa Windowsissa olevan ohjaimen (ohjattua toimintoa ei tule n&auml;kyviin), p&auml;ivit&auml; ohjain asettamalla Intel CD -levy CD-asemaan ja napsauttamalla <b>Asenna ohjaimet</b> -painiketta, kun <b>Intel PRO -verkkoyhteydet</b> -suoritusohjelman ikkuna tulee n&auml;ytt&ouml;&ouml;n.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Kun <b>Asennusvaihtoehdot</b> -valintaikkuna tulee n&auml;ytt&ouml;&ouml;n, valitse <b>Edistyneet verkkopalvelut</b>, jos haluat m&auml;&auml;ritt&auml;&auml; ryhmi&auml; tai VLAN-verkkoja.</p>
  </li>
</ol>
</font>
<DIV>
<h3><font color="#000000">Windows NT* 4.0</font></h3>
<P>
<font color="#000000">Huomautus:  Intel PROSet -apuohjelma asennetaan automaattisesti sovittimen ohjaimen asentamisen yhteydess&auml;.</font></P>
<ol>
  <li>
    <p CLASS="numlst"><font color="#000000">K&auml;ynnist&auml; Windows NT* 4.0, kaksoisnapsauta Ohjauspaneelin Verkko-kuvaketta, valitse Sovittimet-v&auml;lilehti ja valitse sitten Lis&auml;&auml;.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Kun n&auml;ytt&ouml;&ouml;n tulee sovittimien luettelo, &auml;l&auml; valitse sovitinta luettelosta, vaan aseta sovittimen mukana toimitettu CD-levy tietokoneeseen tai osoita muuta tietov&auml;linett&auml; ja valitse Levy-painike.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Jos n&auml;ytt&ouml;&ouml;n tulee CD-levyn suoritusohjelman ikkuna, sulje se ja jatka.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">M&auml;&auml;rit&auml; polku, valitse OK ja jatka asennusta. Kun toimenpide on valmis, uusi Intel-sovitin n&auml;kyy Verkkosovittimet-luettelossa.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Lopeta asennus valitsemalla Sulje.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">K&auml;ynnist&auml; tietokone uudelleen.</font></p>
  </li>
</ol>
</DIV>
<h3>
<font color="#000000">Linux</font> </h3>
<p>Voit muodostaa t&auml;m&auml;n ohjaimen binaarisen RPM*-tiedoston suorittamalla komennon&nbsp;'rpmbuild -tb &lt;tiedostonimi.tar.gz&gt;'. Korvaa &lt;tiedostonimi.tar.gz&gt; ohjaimen nimell&auml;.</p>
<table cellPadding="4" width="100%" border="0">
  <tr>
    <td vAlign="top" align="middle" width="21">
    &nbsp;</td>
    <td><i><b>HUOMAUTUKSIA</b>: Jotta koontik&auml;&auml;nn&ouml;s toimisi oikein, parhaillaan toiminnassa olevan ytimen ON vastattava asennettujen ydinl&auml;hteiden versiota ja kokoonpanoa. Jos olet juuri k&auml;&auml;nt&auml;nyt ytimen uudelleen, k&auml;ynnist&auml; j&auml;rjestelm&auml; nyt uudelleen.
    <p>RPM-toiminnot on testattu vain Red Hat -jakeluissa.<p>K&auml;yt&auml; Intel PRO/100 -sovittimien kohdalla ohjaimen nime&auml; e100.</td>
  </tr>
</table>
<ol>
  <li>
  <p class="numlst">Siirr&auml; perusohjaimen tar-tiedosto valitsemaasi hakemistoon. K&auml;yt&auml; esimerkiksi hakemistoa '/home/username/e1000' or '/usr/local/src/e1000'.
  </li>
  <li>
  <p class="numlst">Pura pakattu tiedosto seuraavalla komennolla, jossa &lt;x.x.x&gt; on ohjaimen tar-tiedoston version numero: </p>
  <blockquote>
    <p class="numlst">tar zxf e1000-&lt;x.x.x&gt;.tar.gz </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Siirry ohjaimen src-hakemistoon seuraavalla komennolla, jossa &lt;x.x.x&gt; on ohjaimen tar-tiedoston version numero: </p>
  <blockquote>
    <p class="numlst">cd e1000-&lt;x.x.x&gt;/src/ </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">K&auml;&auml;nn&auml; ohjainmoduuli seuraavalla komennolla: </p>
  <blockquote>
    <p class="numlst">make install </p>
  </blockquote>
  <p class="numlst">Binaaritiedosto asennetaan seuraavalla nimell&auml; seuraavaan hakemistoon:</p>
  <blockquote>
    <p class="numlst">/lib/modules/&lt;kernel_version&gt;/kernel/drivers/net/e1000.o</p>
  </blockquote>
  <p class="numlst">Edell&auml; annetut asennuskohteet ovat oletuskohteita. Ne eiv&auml;t ehk&auml; vastaa joidenkin Linux-jakeluiden asennuskohteita. Saat lis&auml;tietoja siirtym&auml;ll&auml; tiedostoon <a href="../LINUX/ldistrib.htm">ldistrib.htm</a>.</li>
  <li>
  <p class="numlst">Asenna moduuli seuraavalla komennolla: </p>
  <blockquote>
    <p class="numlst">insmod e1000 &lt;parametri&gt;=&lt;arvo&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">M&auml;&auml;rit&auml; liittym&auml;n IP-osoite antamalla seuraava komento, jossa &lt;x&gt; on liittym&auml;n numero: </p>
  <blockquote>
    <p class="numlst">ifconfig eth&lt;x&gt; &lt;IP_osoite&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Varmista, ett&auml; liittym&auml; toimii. Voit tehd&auml; sen antamalla seuraavan komennon, jossa &lt;IP_osoite&gt; on toisen koneen IP-osoite samassa aliverkossa, jossa liittym&auml;&auml; testataan: </p>
  <blockquote>
    <p class="numlst">ping &lt;IP_osoite&gt; </p>
  </blockquote>
  </li>
</ol>
<h3>
<font color="#000000">Muut k&auml;ytt&ouml;j&auml;rjestelm&auml;t</font> </h3>
<P><font color="#000000">Tietoja muiden ohjainten asentamisesta on sovittimen CD-levyn sis&auml;lt&auml;m&auml;ss&auml; <i>k&auml;ytt&ouml;oppaassa</i> ja asiakastukisivustossa osoitteessa: <a href="http://support.intel.com">http://support.intel.com</a>.</font></P>
<DIV>
<hr>
<P CLASS="Proc-Step"><font color="#000000">*<a href="ld_fin.htm">Oikeudellisia tietoja</a></font></P>
</DIV>
</BODY>
</HTML>