<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN"><HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
<META NAME="GENERATOR" CONTENT="Microsoft FrontPage 5.0">
<link rel="stylesheet" type="text/css" href="style.css">
<TITLE> Installeringsveiledning for Intel&reg; nettverkskort</TITLE>
</HEAD>
<BODY>
<H1>
<font color="#000000">Installere Intel&reg; PRO-nettverkskort</font></H1>
<p>
<i>Revisjon 04/2004</i></p>
<DIV>
<hr>
<DIV>
<h2>
<font color="#000000">Installere Intel PCI-, PCI-X- eller PCI-Express*-kort</font></h2>
<ol>
  <li>
    <p class="numlst"><font color="#000000">Sl&aring; av datamaskinen og trekk ut str&oslash;mledningen.</font></li>
  <li>
    <p class="numlst"><font color="#000000">Fjern datamaskindekselet og kortspordekselet fra sporet som passer til kortet du bruker.</font></li>
  <li>
    <p class="numlst"><font color="#000000">For <b>PCI Express</b>-kort: Sett inn kortkontakten i PCI Express-sporet og sikre konsollen til chassiset.<br> For <b>PCI- og PCI-X</b>-kort: Plasser kortkontakten bestemt i PCI-sporet til det er helt innsatt. Sikre konsollen til chassiset. </font></li>
  <li>
    <p class="numlst">Sett dekselet p&aring; datamaskinen igjen. Plugg inn str&oslash;mledningen.</li>
</ol>
    <h2>Koble til nettverkskabelen</h2>
</DIV>
<DIV>
</DIV>
<p><font color="#000000"><b>Intel&reg; PRO/100- og PRO/1000-kobberkort:</b> Koble nettverkskabelen eller -kablene til kortet med TPE-nettverkskabel (Twisted Pair Ethernet) kategori 3, 4 eller 5 for 10 Mbps-nettverk. Bruk kategori 5-kabel (4 par) for 100- eller 1000 Mbps-nettverk og for nettverk i boliger.<br> <br> <b>Intel&reg; PRO/1000-fiberkort med SC-kontakt:</b> Ta av dekselet for den fiberoptiske kontakten og ta vare p&aring; det. Sett inn en fiberoptisk SC-kontakt av typen 1000Base-SX dupleks i TX/RX-portene p&aring; kortkonsollen.<br> <br> <b>Intel&reg; PRO/1000-fiberkort med LC-kontakt:</b> Ta av dekselet for den fiberoptiske kontakten og ta vare p&aring; det. Sett inn en LC-kontakt i kortet, med riktig kabling for din korttype <span class="295061618-17042002">(1000BASE-SX eller 1000BASE-LX). Konverteringskabler til andre kontakttyper (for eksempel SC) kan brukes hvis kablingen svarer til de optiske spesifikasjonene for kortet, inkludert lengdebegrensninger.<br> <br></span></font> Start datamaskinen og f&oslash;lg anvisningene for driverinstallering nedenfor.
</DIV>
<h2>
<font color="#000000">Installer driverne og </font>utvidelsene</h2>
<p>
<i><font color="#000000">Obs!  Intel PRO/1000 Server-kort virker ikke med Windows* 95, Windows 98* og Windows Me*-datamaskiner.</font></i></p>
<h3><font color="#000000">Windows operativsystem (bortsett fra Windows NT* 4.0)</font></h3>
<font COLOR="#231f20">
<p ALIGN="LEFT">Legg merke til at du m&aring; ha administratorrettigheter til operativsystemet for &aring; installere driverne. </p>
<ol>
  <li>
<p ALIGN="LEFT" class="numlst">Kortet oppdages, og Windows enten installerer en Windows-resident driver eller starter veiviseren <b>Funnet ny mskinvare</b>.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Hvis veiviseren starter, skal du f&oslash;lge ledeteksten for &aring; installere driveren fra CD-en i denne pakken.  </p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Hvis en Windows-resident driver installerer (veiviseren vises ikke), skal du oppdatere driveren ved &aring; sette inn Intel-CD-en og klikke p&aring; <b>Installer drivere</b>-knappen n&aring;r kj&oslash;rvinduet<b>Intel PRO Network Connections </b>vises.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">N&aring;r dialogen <b>Installer alternativ</b> vises, velger du <b>Avanserte nettverkstjenester</b>hvis du har behov for &aring; sette opp grupper eller VLAN.</p>
  </li>
</ol>
</font>
<DIV>
<h3><font color="#000000">Windows NT* 4.0</font></h3>
<P>
<font color="#000000">Obs!  Programvaren for Intel PROSet-verkt&oslash;yet installeres automatisk under installeringen av driveren.</font></P>
<ol>
  <li>
    <p CLASS="numlst"><font color="#000000">Start Windows NT 4.0, dobbeltklikk ikonet Nettverk i kontrollpanelet, velg kategorien Kort og klikk Legg til.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">N&aring;r du ser en liste over kort, setter du inn CD-ROM-en som fulgte med kortet, eller peker p&aring; det andre mediet, og klikker Har diskett i stedet for &aring; velge et kort i listen.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Hvis det kommer frem et Autorun-vindu, lukker du det og fortsetter.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Angi banen, klikk OK og fortsett installeringen. N&aring;r installeringen er ferdig, kommer det nye Intel-kortet frem i listen Nettverkskort.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Klikk Lukk for &aring; fullf&oslash;re.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Start datamaskinen p&aring; nytt.</font></p>
  </li>
</ol>
</DIV>
<h3>
<font color="#000000">Linux*</font> </h3>
<p>For &aring; bygge en bin&aelig;r RPM*-pakke med denne driveren, kj&oslash;rer du 'rpmbuild -tb &lt;filename.tar.gz&gt;'. Skift ut &lt;filename.tar.gz&gt; med det spesifikke filnavnet til driveren.</p>
<table cellPadding="4" width="100%" border="0">
  <tr>
    <td vAlign="top" align="middle" width="21">
    &nbsp;</td>
    <td><i><b>MERKNADER</b>:</i> For at konstruksjonen skal virke ordentlig, M&Aring; den kjernen som er i bruk, passe til versjonen og konfigurasjonen for de installerte kjernekildene. Hvis du nettopp har rekompilert kjernen, m&aring; du starte systemet opp p&aring; nytt n&aring;.
    <p>RPM-funksjonaliteten er kun blitt testet in Red Hat-distribueringer.<p>Bruk e100 som drivernavn for Intel PRO/100-kort.</td>
  </tr>
</table>
<ol>
  <li>
  <p class="numlst">Flytt m&aring;lfilen for basisdriveren til mappen du har valgt. For eksempel: bruk '/home/username/e1000' eller '/usr/local/src/e1000'.
  </li>
  <li>
  <p class="numlst">Untar/unzip arkivet, der &lt;x.x.x&gt; er versjonsnummeret for driver-tar file: </p>
  <blockquote>
    <p class="numlst">tar zxf e1000-&lt;x.x.x&gt;.tar.gz </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Endre til driver src-katalog, der &lt;x.x.x&gt; er versjonsnummeret for driver-tar: </p>
  <blockquote>
    <p class="numlst">cd e1000-&lt;x.x.x&gt;/src/ </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Kompiler drivermodulen: </p>
  <blockquote>
    <p class="numlst">gj&oslash;r installering</p>
  </blockquote>
  <p class="numlst">Den bin&aelig;re vil bli installert som:</p>
  <blockquote>
    <p class="numlst">/lib/modules/&lt;kjerneversjon&gt;/kernel/drivers/sensors</p>
  </blockquote>
  <p class="numlst">Installasjonsplasseringene som angitt foran, er standardplasseringer. Det kan hende de ikke er korrekte for visse Linux-distribusjoner. For &aring; f&aring; mer informasjon, skal du g&aring; til <a href="../LINUX/ldistrib.htm">ldistrib.htm</a>.</li>
  <li>
  <p class="numlst">Installer modulen: </p>
  <blockquote>
    <p class="numlst">insmod e1000 &lt;parameter&gt;=&lt;value&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Tildel en IP-adresse til grensesnittet ved &aring; skrive inn f&oslash;lgende, der &lt;x&gt; er grensesnittnummeret: </p>
  <blockquote>
    <p class="numlst">ifconfig eth&lt;x&gt; &lt;IP_address&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Bekreft at grensesnittet virker. Skriv inn f&oslash;lgende, der &lt;IP_address&gt; er IP-adressen til en annen maskin p&aring; det samme undernettet som det grensesnittet som testes: </p>
  <blockquote>
    <p class="numlst">ping &lt;IP_address&gt; </p>
  </blockquote>
  </li>
</ol>
<h3>
<font color="#000000">Andre operativsystemer</font> </h3>
<P><font color="#000000">Hvis du vil installere andre drivere, kan du se <i>Brukerh&aring;ndboken</i> p&aring; CD-ROM-en for kortet eller g&aring; til webomr&aring;det for kundest&oslash;tte: <a href="http://support.intel.com">http://support.intel.com</a>.</font></P>
<DIV>
<hr>
<P CLASS="Proc-Step"><font color="#000000">*<a href="ld_nor.htm">Juridisk informasjon</a></font></P>
</DIV>
</BODY>
</HTML>