<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN"><HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
<META NAME="GENERATOR" CONTENT="Microsoft FrontPage 5.0">
<link rel="stylesheet" type="text/css" href="style.css">
<TITLE> Guia de instala&ccedil;&atilde;o r&aacute;pida dos adaptadores de rede Intel&reg;</TITLE>
</HEAD>
<BODY>
<H1>
<font color="#000000">Instala&ccedil;&atilde;o do adaptador de rede Intel&reg; PRO</font></H1>
<p>
<i>Revis&atilde;o 04/2004</i></p>
<DIV>
<hr>
<DIV>
<h2>
<font color="#000000">Instalar o adaptador Intel PCI, PCI-X ou PCI-Express*</font></h2>
<ol>
  <li>
    <p class="numlst"><font color="#000000">Desligue o computador e desconecte o fio de eletricidade.</font></li>
  <li>
    <p class="numlst"><font color="#000000">Remova a tampa do computador e a tampa do slot correspondente ao seu adaptador.</font></li>
  <li>
    <p class="numlst"><font color="#000000">Para adaptadores <b>PCI Express</b>: insira a borda do conector no slot PCI Express e prenda a bra&ccedil;adeira ao chassi.<br> Para adaptadores <b>PCI e PCI-X</b>: empurre firmemente a borda do adaptador no slot PCI at&eacute; que ele esteja completamente inserido. Prenda a bra&ccedil;adeira ao chassi. </font></li>
  <li>
    <p class="numlst">Recoloque a tampa do computador. Ligue o fio de eletricidade.</li>
</ol>
    <h2>Conecte o cabo de rede</h2>
</DIV>
<DIV>
</DIV>
<p><font color="#000000"><b>Adaptadores Intel&reg; PRO/100 e PRO/1000 de cobre:</b> Conecte o(s) cabo(s) de rede ao adaptador usando cabos de par tran&ccedil;ado Ethernet (TPE) Categoria 3, 4 ou 5 para redes de 10 Mbps. Use cabos categoria 5 (4 pares) para as redes de 100 ou 1000 Mbps e para as redes residenciais.<br> <br> <b>Adaptadores de fibra Intel&reg; PRO/1000 com conector SC:</b> Remova e guarde a tampa do conector de fibra &oacute;tica. Insira um conector de fibra &oacute;tica SC do tipo 1000Base-SX duplex nas portas TX/RX da bra&ccedil;adeira do adaptador.<br> <br> <b>Adaptadores de fibra Intel&reg; PRO/1000 com conector LC:</b> Remova e guarde a tampa do conector de fibra &oacute;tica. Insira um conector LC no adaptador com o cabeamento correto para o seu tipo de adaptador <span class="295061618-17042002">(1000BASE-SX ou 1000BASE-LX). Podem ser usados cabos de convers&atilde;o para outros tipos de conectores (como, por exemplo, SC) se o cabeamento corresponder &agrave;s especifica&ccedil;&otilde;es &oacute;ticas do adaptador, inclusive as limita&ccedil;&otilde;es de comprimento.<br> <br></span></font> Ligue o computador e siga as instru&ccedil;&otilde;es de instala&ccedil;&atilde;o do driver.
</DIV>
<h2>
<font color="#000000">Instalar os drivers e </font>extens&otilde;es</h2>
<p>
<i><font color="#000000"> Nota:  Os adaptadores de servidor Intel PRO/1000 n&atilde;o funcionam com os sistemas operacionais Windows* 95, Windows 98* e Windows Me*.</font></i></p>
<h3><font color="#000000">Sistemas operacionais Windows (exceto Windows NT* 4.0)</font></h3>
<font COLOR="#231f20">
<p ALIGN="LEFT">Note que voc&ecirc; deve ter direitos de administrador para o sistema operacional instalar os drivers. </p>
<ol>
  <li>
<p ALIGN="LEFT" class="numlst">O adaptador &eacute; detectado e o Windows instala um driver residente do Windows ou inicia o assistente de <b>Novo hardware encontrado</b>.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Se esse assistente iniciar, siga as orienta&ccedil;&otilde;es para instalar o driver a partir do CD nesse pacote.  </p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Se for instalado um driver residente do Windows (o assistente n&atilde;o aparece), atualize o driver inserindo o CD da Intel e clicando no bot&atilde;o <b>Instalar os drivers </b>quando aparecer a janela de execu&ccedil;&atilde;o autom&aacute;tica <b>Conex&otilde;es de rede Intel PRO</b>.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Quando o di&aacute;logo <b>Instalar op&ccedil;&otilde;es </b>aparecer, escolha <b>Servi&ccedil;os avan&ccedil;ados de rede </b>se necessitar configurar grupos ou VLANs.</p>
  </li>
</ol>
</font>
<DIV>
<h3><font color="#000000">Windows NT 4.0</font></h3>
<P>
<font color="#000000">Nota:  o software do utilit&aacute;rio Intel PROSet &eacute; instalado automaticamente durante a instala&ccedil;&atilde;o do driver do adaptador.</font></P>
<ol>
  <li>
    <p CLASS="numlst"><font color="#000000">Inicie o Windows NT 4.0, clique duas vezes no &iacute;cone Rede no Painel de controle, clique na guia Adaptadores e clique em Adicionar.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Quando a lista de adaptadores aparecer, em vez de escolher um adaptador da lista, insira o CD fornecido com o seu adaptador ou aponte para a outra m&iacute;dia e clique em &ldquo;Com disco&rdquo;.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Se aparecer a tela de Execu&ccedil;&atilde;o autom&aacute;tica do CD, feche-a e continue.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Especifique o caminho, clique em OK e continue a instala&ccedil;&atilde;o. Ao completar a instala&ccedil;&atilde;o, aparecer&aacute; o novo adaptador Intel na lista de Adaptadores de Rede.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Clique em Fechar para terminar.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Reinicialize o computador.</font></p>
  </li>
</ol>
</DIV>
<h3>
<font color="#000000">Linux*</font> </h3>
<p>Para compilar um pacote RPM* bin&aacute;rio deste driver execute 'rpmbuild -tb &lt;filename.tar.gz&gt;'. Substitua &lt;filename.tar.gz&gt; com o nome de arquivo espec&iacute;fico do driver.</p>
<table cellPadding="4" width="100%" border="0">
  <tr>
    <td vAlign="top" align="middle" width="21">
    &nbsp;</td>
    <td><i><b>NOTAS</b>:</i> Para que a compila&ccedil;&atilde;o funcione adequadamente, o kernel sendo executado no momento DEVE coincidir com a vers&atilde;o e configura&ccedil;&atilde;o das fontes do kernel instaladas. Se j&aacute; tiver recompilado o kernel, reinicialize agora o sistema.
    <p>A funcionalidade do RPM foi testada somente nas distribui&ccedil;&otilde;es do Red Hat.<p>Para os adaptadores Intel PRO/100 use e100 como o nome do driver.</td>
  </tr>
</table>
<ol>
  <li>
  <p class="numlst">Mova o arquivo tar do driver b&aacute;sico para o diret&oacute;rio de sua escolha. Por exemplo, use '/home/username/e1000' ou '/usr/local/src/e1000'.
  </li>
  <li>
  <p class="numlst">Para efetuar o untar/unzip do arquivo, onde &lt;x.x.x&gt; &eacute; o n&uacute;mero da vers&atilde;o do arquivo tar do driver: </p>
  <blockquote>
    <p class="numlst">tar zxf e1000-&lt;x.x.x&gt;.tar.gz </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Mude para o diret&oacute;rio src do driver, onde &lt;x.x.x&gt; &eacute; o n&uacute;mero da vers&atilde;o do tar do driver: </p>
  <blockquote>
    <p class="numlst">cd e1000-&lt;x.x.x&gt;/src/ </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Compile o m&oacute;dulo do driver: </p>
  <blockquote>
    <p class="numlst">make install </p>
  </blockquote>
  <p class="numlst">O bin&aacute;rio ser&aacute; instalado como:</p>
  <blockquote>
    <p class="numlst">/lib/modules/&lt;kernel_version&gt;/kernel/drivers/net/e1000.o</p>
  </blockquote>
  <p class="numlst">Os locais de instala&ccedil;&atilde;o listados acima s&atilde;o os locais padr&atilde;o. Eles podem n&atilde;o estar corretos para certas distribui&ccedil;&otilde;es do Linux. Para mais informa&ccedil;&otilde;es v&aacute; para <a href="../LINUX/ldistrib.htm">ldistrib.htm</a>.</li>
  <li>
  <p class="numlst">Instalar o m&oacute;dulo: </p>
  <blockquote>
    <p class="numlst">insmod e1000 &lt;par&acirc;metro&gt;=&lt;valor&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Atribuir um endere&ccedil;o IP para a interface digitando o seguinte, onde &lt;x&gt; &eacute; o n&uacute;mero da interface: </p>
  <blockquote>
    <p class="numlst">ifconfig eth&lt;x&gt; &lt;endere&ccedil;o_IP&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Verifique se a interface funciona. Digite o seguinte, onde &lt;endere&ccedil;o_IP&gt; &eacute; o endere&ccedil;o IP para uma outra m&aacute;quina na mesma subrede que a interface que est&aacute; sendo testada: </p>
  <blockquote>
    <p class="numlst">ping &lt;endere&ccedil;o_IP&gt; </p>
  </blockquote>
  </li>
</ol>
<h3>
<font color="#000000">Outros sistemas operacionais</font> </h3>
<P><font color="#000000">Para instalar outros drivers, consulte o <i>Guia do usu&aacute;rio</i> no CD do adaptador ou visite o site de suporte: <a href="http://support.intel.com">http://support.intel.com</a> </font></P>
<DIV>
<hr>
<P CLASS="Proc-Step"><font color="#000000">*<a href="ld_ptb.htm">Assuntos legais</a></font></P>
</DIV>
</BODY>
</HTML>