<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0//EN"><HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1254">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">
<META NAME="GENERATOR" CONTENT="Microsoft FrontPage 5.0">
<link rel="stylesheet" type="text/css" href="style.css">
<TITLE> Intel&reg; Að Baðdaþtýrýcýlarý Hýzlý Kuruluþ Kýlavuzu</TITLE>
</HEAD>
<BODY>
<H1>
<font color="#000000">Intel&reg; PRO Að Baðdaþtýrýcýsýný Kurma</font></H1>
<p>
<i>Revizyon 04/2004</i></p>
<DIV>
<hr>
<DIV>
<h2>
<font color="#000000">Intel PCI, PCI-X ya da PCI-Express* Baðdaþtýrýcýsýný Takma</font></h2>
<ol>
  <li>
    <p class="numlst"><font color="#000000">Bilgisayarý kapatýp elektrik kablosunu prizden &ccedil;ekin.</font></li>
  <li>
    <p class="numlst"><font color="#000000">Bilgisayarýn kapaðýný ve baðdaþtýrýcýnýza uyan yuvanýn yuva kapaðýný &ccedil;ýkartýn.</font></li>
  <li>
    <p class="numlst"><font color="#000000"><b>PCI Express</b> baðdaþtýrýcýlarý i&ccedil;in: Baðdaþtýrýcýnýn kenar baðlayýcýsýný PCI Express yuvasýna oturtun ve kasaya sabitleyin.<br> <b>PCI ve PCI-X</b> baðdaþtýrýcýlarý i&ccedil;in: Baðdaþtýrýcýnýn kenar baðlayýcýsýna bastýrarak PCI yuvasýna sýkýca oturmasýný saðlayýn. Baðdaþtýrýcýyý kasaya sabitleyin. </font></li>
  <li>
    <p class="numlst">Bilgisayarýn kapaðýný tekrar takýn. Elektrik fiþini tekrar baðlayýn.</li>
</ol>
    <h2>Að Kablosunu Takma</h2>
</DIV>
<DIV>
</DIV>
<p><font color="#000000"><b>Intel&reg; PRO/100 ve PRO/1000 bakýr baðdaþtýrýcýlarý:</b> Baðdaþtýrýcýya 10 Mb/sn aðlara &ouml;zg&uuml; Kategori 3, 4 ya da 5 B&uuml;k&uuml;ml&uuml; &Ccedil;ift Ethernet (TPE) að kablosu ya da kablolarý takýn. 100 veya 1000 Mb/sn aðlar ve diðer sabit aðlar i&ccedil;in Kategori 5 (4 &ccedil;ift) kablosu kullanýn.<br> <br> <b>SC baðlayýcýlý Intel&reg; PRO/1000 fiber baðdaþtýrýcýlarý:</b> Fiber optik baðlayýcý kapaðýný &ccedil;ýkartýn ve saklayýn. Baðdaþtýrýcý &uuml;zerindeki TX/RX baðlantý noktalarýna 1000Base-SX dupleks tipte SC fiber optik baðlayýcý takýn.<br> <br> <b>LC baðlayýcýlý Intel&reg; PRO/1000 fiber baðdaþtýrýcýlarý:</b> Fiber optik baðlayýcý kapaðýný &ccedil;ýkartýn ve saklayýn. Baðdaþtýrýcýya baðdaþtýrýcý t&uuml;r&uuml;ne uygun <span class="295061618-17042002">(1000BASE-SX veya 1000BASE-LX) kablolu bir LC baðlayýcýsý takýn. Baðdaþtýrýcýnýn uzunluk sýnýrlamalarý da dahil olmak &uuml;zere optik spesifikasyonuna uyuyorsa, diðer baðlayýcý t&uuml;rlerine (&ouml;rneðin SC) d&ouml;n&uuml;þt&uuml;rme kablolarý da kullanýlabilir.<br> <br></span></font> Bilgisayarýnýzý baþlatýp aþaðýdaki s&uuml;r&uuml;c&uuml; y&uuml;kleme y&ouml;nergelerini izleyin.
</DIV>
<h2>
<font color="#000000">S&uuml;r&uuml;c&uuml;leri ve </font>Uzantýlarý Y&uuml;kleme</h2>
<p>
<i><font color="#000000">Not:  Intel PRO/1000 Server Adapter'lar Windows* 95, Windows 98* ve Windows Me* bilgisayarlarý ile &ccedil;alýþmaz.</font></i></p>
<h3><font color="#000000">Windows Ýþletim Sistemleri (Windows NT* 4.0 dýþýndakiler)</font></h3>
<font COLOR="#231f20">
<p ALIGN="LEFT">S&uuml;r&uuml;c&uuml;leri y&uuml;klemek i&ccedil;in iþletim sistemi &uuml;zerinde y&ouml;netici haklarýna sahip olmanýz gerekir. </p>
<ol>
  <li>
<p ALIGN="LEFT" class="numlst">Baðdaþtýrýcý algýlanýr ve Windows tarafýndan Windows'ta yerleþik olarak bulunan bir s&uuml;r&uuml;c&uuml; y&uuml;klenir veya <b>Yeni Donaným Bulundu </b>sihirbazý baþlatýlýr.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Sihirbaz baþlarsa, bu paketteki CD'de bulunan s&uuml;r&uuml;c&uuml;y&uuml; y&uuml;klemek i&ccedil;in bilgi istemlerini izleyin.  </p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst">Windows'ta yerleþik olarak bulunan bir s&uuml;r&uuml;c&uuml; y&uuml;klenirse (sihirbaz baþlamazsa), s&uuml;r&uuml;c&uuml;y&uuml; g&uuml;ncelleþtirmek i&ccedil;in Intel CD'sini takýn, otomatik olarak g&ouml;r&uuml;nt&uuml;lenen <b>Intel PRO Network Connections </b>(Intel PRO Að Baðlantýlarý) penceresinde <b>Install Drivers </b>(S&uuml;r&uuml;c&uuml;leri Y&uuml;kle) d&uuml;ðmesini týklatýn.</p>
  </li>
  <li>
<p ALIGN="LEFT" class="numlst"><b>Install Options </b>(Y&uuml;kleme Se&ccedil;enekleri) iletiþim kutusu g&ouml;r&uuml;nt&uuml;lendiðinde, ekip veya VLAN kurulumu yapmanýz gerekiyorsa <b>Advanced Network Services </b>(Geliþmiþ Að Hizmetleri) se&ccedil;eneðini belirleyin.</p>
  </li>
</ol>
</font>
<DIV>
<h3><font color="#000000">Windows NT 4.0</font></h3>
<P>
<font color="#000000">Not:  Intel PROSet yardýmcý yazýlýmý baðdaþtýrýcý s&uuml;r&uuml;c&uuml;s&uuml;n&uuml;n kuruluþu sýrasýnda otomatik olarak kurulur.</font></P>
<ol>
  <li>
    <p CLASS="numlst"><font color="#000000">Windows NT 4.0 bilgisayarýný baþlatýn, Control Panel'daki (Denetim Masasý) Network (Að) simgesini &ccedil;ift týklatýn, Adapters (Baðdaþtýrýcýlar) sekmesini ve Add (Ekle) d&uuml;ðmesini týklatýn.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Baðdaþtýrýcý listesi g&ouml;r&uuml;nt&uuml;lendiðinde listeden bir baðdaþtýrýcý se&ccedil;mek yerine baðdaþtýrýcýnýzla birlikte verilen CD'yi takýn ya da diðer ortamý se&ccedil;in ve Have Disk (Disketi Var) d&uuml;ðmesini týklatýn.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">CD'yi otomatik &ccedil;alýþtýrma ekraný g&ouml;r&uuml;nt&uuml;lenirse ekraný kapatýn.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Yolu belirtin, OK (Tamam) d&uuml;ðmesini týklatýn ve kuruluþa devam edin. Ýþlem tamamlandýktan sonra yeni Intel baðdaþtýrýcýsý Network Adapters (Að Baðdaþtýrýcýlarý) listesinde g&ouml;r&uuml;nt&uuml;lenir.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Ýþlemi sona erdirmek i&ccedil;in Close (Kapat) d&uuml;ðmesini týklatýn.</font></li>
  <li>
    <p CLASS="numlst"><font color="#000000">Bilgisayarýnýzý yeniden baþlatýn.</font></p>
  </li>
</ol>
</DIV>
<h3>
<font color="#000000">Linux*</font> </h3>
<p>Bu s&uuml;r&uuml;c&uuml; i&ccedil;in ikili RPM* paketi oluþturmak &uuml;zere 'rpmbuild -tb &lt;dosya_adý.tar.gz&gt;' komutunu &ccedil;alýþtýrýn. &lt;Dosya_adý.tar.gz&gt; deðerinin yerine s&uuml;r&uuml;c&uuml;n&uuml;n dosya adýný yazýn.</p>
<table cellPadding="4" width="100%" border="0">
  <tr>
    <td vAlign="top" align="middle" width="21">
    &nbsp;</td>
    <td><i><b>NOTLAR</b>:</i> Paketin d&uuml;zg&uuml;n &ccedil;alýþmasý i&ccedil;in, &ccedil;alýþmakta olan &ccedil;ekirdeðin s&uuml;r&uuml;m&uuml; ve yapýlandýrmasý, y&uuml;kl&uuml; &ccedil;ekirdek kaynaklarýnýnkiyle EÞLEÞMELÝDÝR. &Ccedil;ekirdeði yeniden derlediyseniz, sistemi þimdi yeniden baþlatýn.
    <p>RPM iþlevi yalnýzca Red Hat daðýtýmlarýnda sýnanmýþtýr.<p>Intel PRO/100 baðdaþtýrýcýlarýnda s&uuml;r&uuml;c&uuml; adý olarak e100 yazýn.</td>
  </tr>
</table>
<ol>
  <li>
  <p class="numlst">Ana s&uuml;r&uuml;c&uuml; tar dosyasýný istediðiniz bir dizine taþýyýn. &Ouml;rneðin '/home/kullanc/e1000' ya da '/usr/local/src/e1000'. 
  </li>
  <li>
  <p class="numlst">Sýkýþtýrýlmýþ arþiv dosyasýný a&ccedil;ýn (burada &lt;x.x.x&gt;, s&uuml;r&uuml;c&uuml; tar dosyasýnýn s&uuml;r&uuml;m numarasýdýr): </p>
  <blockquote>
    <p class="numlst">tar zxf e1000-&lt;x.x.x&gt;.tar.gz </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">S&uuml;r&uuml;c&uuml;n&uuml;n src dizinine ge&ccedil;in (burada &lt;x.x.x&gt;, s&uuml;r&uuml;c&uuml; tar dosyasýnýn s&uuml;r&uuml;m numarasýdýr): </p>
  <blockquote>
    <p class="numlst">cd e1000-&lt;x.x.x&gt;/src/ </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">S&uuml;r&uuml;c&uuml; mod&uuml;l&uuml;n&uuml; derleyin: </p>
  <blockquote>
    <p class="numlst">make install </p>
  </blockquote>
  <p class="numlst">Ýkili dosya aþaðýdaki konuma y&uuml;klenecektir:</p>
  <blockquote>
    <p class="numlst">/lib/modules/&lt;&ccedil;ekirdek_s&uuml;r&uuml;m&uuml;&gt;/kernel/drivers/net/e1000.o</p>
  </blockquote>
  <p class="numlst">Yukarýda belirtilen y&uuml;kleme konumlarý, varsayýlan konumlardýr. Bu deðerler, bazý Linux daðýtýmlarý i&ccedil;in doðru olmayabilir. Daha fazla bilgi i&ccedil;in <a href="../LINUX/ldistrib.htm">ldistrib.htm</a> dosyasýna bakýn.</li>
  <li>
  <p class="numlst">Mod&uuml;l&uuml; y&uuml;kleyin: </p>
  <blockquote>
    <p class="numlst">insmod e1000 &lt;parametre&gt;=&lt;deðer&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Aþaðýdaki komutu girerek arabirime bir IP adresi atayýn (burada &lt;x&gt;, arabirim numarasýdýr): </p>
  <blockquote>
    <p class="numlst">ifconfig eth&lt;x&gt; &lt;IP_adresi&gt; </p>
  </blockquote>
  </li>
  <li>
  <p class="numlst">Arabirimin &ccedil;alýþtýðýný doðrulayýn. Aþaðýdaki komutu girin (burada &lt;IP_adresi&gt;, sýnanan arabirimle ayný alt aðda yer alan baþka bir makinenin IP adresidir): </p>
  <blockquote>
    <p class="numlst">ping &lt;IP_adresi&gt; </p>
  </blockquote>
  </li>
</ol>
<h3>
<font color="#000000">Diðer Ýþletim Sistemleri</font> </h3>
<P><font color="#000000">Baþka s&uuml;r&uuml;c&uuml;ler y&uuml;klemek i&ccedil;in, baðdaþtýrýcýnýn CD'sindeki <i>User's Guide</i> (Kullanýcý Kýlavuzu) belgesine bakýn ya da m&uuml;þteri hizmetleri web sitesini ziyaret edin: <a href="http://support.intel.com">http://support.intel.com</a>.</font></P>
<DIV>
<hr>
<P CLASS="Proc-Step"><font color="#000000">*<a href="ld_trk.htm">Yasal Bilgiler</a></font></P>
</DIV>
</BODY>
</HTML>